{"results":[{"id":1,"title":"Jurassic World: Fallen Kingdom","genres":[1,2,15],"description":"Several years after the demise of Jurassic World, a volcanic eruption threatens the remaining dinosaurs on the island of Isla Nublar. Claire Dearing, the former park manager and founder of the Dinosaur Protection Group, recruits Owen Grady to help prevent the extinction of the dinosaurs once again.","release_date":"2018-06-06","image":"c9XxwwhPHdaImA2f1WEfEsbhaFB.jpg"},{"id":2,"title":"Ant-Man and the Wasp","genres":[1,2,9,4,15],"description":"As Scott Lang awaits expiration of his term of house detention, Hope van Dyne and Dr. Hank Pym involve him in a scheme to rescue Mrs. van Dyne from the micro-universe into which she has fallen, while two groups of schemers converge on them with intentions of stealing Dr. Pym's inventions.","release_date":"2018-07-04","image":"rv1AWImgx386ULjcf62VYaW8zSt.jpg"},{"id":3,"title":"Thor: Ragnarok","genres":[1,2,4],"description":"Thor is on the other side of the universe and finds himself in a race against time to get back to Asgard to stop Ragnarok, the prophecy of destruction to his homeworld and the end of Asgardian civilization, at the hands of an all-powerful new threat, the ruthless Hela.","release_date":"2017-10-25","image":"rzRwTcFvttcN1ZpX2xv4j3tSdJu.jpg"},{"id":4,"title":"Avengers: Infinity War","genres":[2,15,9,1],"description":"As the Avengers and their allies have continued to protect the world from threats too large for any one hero to handle, a new danger has emerged from the cosmic shadows: Thanos. A despot of intergalactic infamy, his goal is to collect all six Infinity Stones, artifacts of unimaginable power, and use them to inflict his twisted will on all of reality. Everything the Avengers have fought for has led up to this moment - the fate of Earth and existence itself has never been more uncertain.","release_date":"2018-04-25","image":"7WsyChQLEftFiDOVTGkv3hFpyyt.jpg"},{"id":5,"title":"Mission: Impossible - Fallout","genres":[2,1,17],"description":"When an IMF mission ends badly, the world is faced with dire consequences. As Ethan Hunt takes it upon himself to fulfil his original briefing, the CIA begin to question his loyalty and his motives. The IMF team find themselves in a race against time, hunted by assassins while trying to prevent a global catastrophe.","release_date":"2018-07-25","image":"80PWnSTkygi3QWWmJ3hrAwqvLnO.jpg"},{"id":6,"title":"Incredibles 2","genres":[1,2,3,8],"description":"Elastigirl springs into action to save the day, while Mr. Incredible faces his greatest challenge yet – taking care of the problems of his three children.","release_date":"2018-06-14","image":"x1txcDXkcM65gl7w20PwYSxAYah.jpg"},{"id":7,"title":"Fifty Shades Freed","genres":[7,14],"description":"Believing they have left behind shadowy figures from their past, newlyweds Christian and Ana fully embrace an inextricable connection and shared life of luxury. But just as she steps into her role as Mrs. Grey and he relaxes into an unfamiliar stability, new threats could jeopardize their happy ending before it even begins.","release_date":"2018-01-17","image":"jjPJ4s3DWZZvI4vw8Xfi4Vqa1Q8.jpg"},{"id":8,"title":"The First Purge","genres":[1,11,15,17],"description":"To push the crime rate below one percent for the rest of the year, the New Founding Fathers of America test a sociological theory that vents aggression for one night in one isolated community. But when the violence of oppressors meets the rage of the others, the contagion will explode from the trial-city borders and spread across the nation.","release_date":"2018-07-04","image":"2slvblTroiT1lY9bYLK7Amigo1k.jpg"},{"id":9,"title":"Ready Player One","genres":[2,15,9],"description":"When the creator of a popular video game system dies, a virtual contest is created to compete for his fortune.","release_date":"2018-03-28","image":"pU1ULUq8D3iRxl1fdX2lZIzdHuI.jpg"},{"id":10,"title":"Rampage","genres":[1,2,15,9],"description":"Primatologist Davis Okoye shares an unshakable bond with George, the extraordinarily intelligent, silverback gorilla who has been in his care since birth.  But a rogue genetic experiment gone awry mutates this gentle ape into a raging creature of enormous size.  To make matters worse, it’s soon discovered there are other similarly altered animals.  As these newly created alpha predators tear across North America, destroying everything in their path, Okoye teams with a discredited genetic engineer to secure an antidote, fighting his way through an ever-changing battlefield, not only to halt a global catastrophe but to save the fearsome creature that was once his friend.","release_date":"2018-04-12","image":"3gIO6mCd4Q4PF1tuwcyI3sjFrtI.jpg"},{"id":11,"title":"The Purge: Anarchy","genres":[11,17],"description":"One night per year, the government sanctions a 12-hour period in which citizens can commit any crime they wish -- including murder -- without fear of punishment or imprisonment. Leo, a sergeant who lost his son, plans a vigilante mission of revenge during the mayhem. However, instead of a death-dealing avenger, he becomes the unexpected protector of four innocent strangers who desperately need his help if they are to survive the night.","release_date":"2014-07-17","image":"l1DRl40x2OWUoPP42v8fjKdS1Z3.jpg"},{"id":12,"title":"Mission: Impossible","genres":[2,1,17],"description":"When Ethan Hunt, the leader of a crack espionage team whose perilous operation has gone awry with no explanation, discovers that a mole has penetrated the CIA, he's surprised to learn that he's the No. 1 suspect. To clear his name, Hunt now must ferret out the real double agent and, in the process, even the score.","release_date":"1996-05-22","image":"vmj2PzTLC6xJvshpq8SlaYE3gbd.jpg"},{"id":13,"title":"The Purge","genres":[15,11,17],"description":"Given the country's overcrowded prisons, the U.S. government begins to allow 12-hour periods of time in which all illegal activity is legal. During one of these free-for-alls, a family must protect themselves from a home invasion.","release_date":"2013-05-31","image":"tGGJOuLHX7UDlTz57sjfhW1qreP.jpg"},{"id":14,"title":"Mission: Impossible - Rogue Nation","genres":[1,2,17],"description":"Ethan and team take on their most impossible mission yet, eradicating the Syndicate - an International rogue organization as highly skilled as they are, committed to destroying the IMF.","release_date":"2015-07-23","image":"z2sJd1OvAGZLxgjBdSnQoLCfn3M.jpg"},{"id":15,"title":"Ant-Man","genres":[15,1,2],"description":"Armed with the astonishing ability to shrink in scale but increase in strength, master thief Scott Lang must embrace his inner-hero and help his mentor, Doctor Hank Pym, protect the secret behind his spectacular Ant-Man suit from a new generation of towering threats. Against seemingly insurmountable obstacles, Pym and Lang must plan and pull off a heist that will save the world.","release_date":"2015-07-14","image":"D6e8RJf2qUstnfkTslTXNTUAlT.jpg"},{"id":16,"title":"Hotel Transylvania 2","genres":[3,4,8,9],"description":"When the old-old-old-fashioned vampire Vlad arrives at the hotel for an impromptu family get-together, Hotel Transylvania is in for a collision of supernatural old-school and modern day cool.","release_date":"2015-09-21","image":"5BGjNYVHWynVNIbo3eF6XhPeB1J.jpg"},{"id":17,"title":"Black Panther","genres":[1,2,9,15],"description":"King T'Challa returns home from America to the reclusive, technologically advanced African nation of Wakanda to serve as his country's new leader. However, T'Challa soon finds that he is challenged for the throne by factions within his own country as well as without. Using powers reserved to Wakandan kings, T'Challa assumes the Black Panther mantel to join with girlfriend Nakia, the queen-mother, his princess-kid sister, members of the Dora Milaje (the Wakandan 'special forces') and an American secret agent, to prevent Wakanda from being dragged into a world war.","release_date":"2018-02-13","image":"uxzzxijgPIY7slzFvMotPv8wjKA.jpg"},{"id":18,"title":"Qayamat: City Under Threat","genres":[1,7,5],"description":"CBI Officer Akram Sheikh (Sunil Shetty) is on the verge of nabbing three dreaded Pakistan-backed arms dealers , the brothers Ali (Arbaaz Khan) and Abbas (Sanjay Kapoor) and their common moll Laila (Isha Koppikar) . When Sheikh busts an important arms deal conducted by his three targets , Ali-Abbas join forces with Gopal (Chunky Pandey) , a corrupt scientist to get hold of a deadly virus and take the tourists at the Elphinstone Jail resort as hostage . Akram Sheikh is now compelled to get help from Rachit (Ajay Devgan) , a criminal serving jail time who was a former associate of Ali-Abbas and the only person in history to have successfully escaped the Elphinstone jail . Along with a commando team , they try to pull off a rescue attempt by breaking in the jail and rescuing the hostages .","release_date":"2003-07-11","image":"e6n3Tf86MJgqtF34bLogGOpkNQf.jpg"},{"id":19,"title":"A Quiet Place","genres":[7,11,17,15],"description":"A family is forced to live in silence while hiding from creatures that hunt by sound.","release_date":"2018-04-03","image":"nAU74GmpUk7t5iklEp3bufwDq4n.jpg"},{"id":20,"title":"Deadpool 2","genres":[1,4,15],"description":"Wisecracking mercenary Deadpool battles the evil and powerful Cable and other bad guys to save a boy's life.","release_date":"2018-05-15","image":"to0spRl1CMDvyUbOnbb4fTk3VAd.jpg"},{"id":21,"title":"Hotel Transylvania 3: Summer Vacation","genres":[8,9,4,3],"description":"Dracula, Mavis, Johnny and the rest of the Drac Pack take a vacation on a luxury Monster Cruise Ship, where Dracula falls in love with the ship's captain, Ericka, who's secretly a descendant of Abraham Van Helsing, the notorious monster slayer.","release_date":"2018-06-30","image":"gjAFM4xhA5vyLxxKMz38ujlUfDL.jpg"},{"id":22,"title":"Detective Conan: Zero the Enforcer","genres":[3,5,13,1,7],"description":"There is a sudden explosion at Tokyo Summit's giant Edge of Ocean facility. The shadow of Tōru Amuro, who works for the National Police Agency Security Bureau as Zero, appears at the site. In addition, the \"triple-face\" character is known as Rei Furuya as a detective and Kogorō Mōri's apprentice, and he is also known as Bourbon as a Black Organization member. Kogorō is arrested as a suspect in the case of the explosion. Conan conducts an investigation to prove Kogorō's innocence, but Amuro gets in his way.","release_date":"2018-04-13","image":"mMWV5MXn2pkDnnI4vWpy3dRWdNC.jpg"},{"id":23,"title":"Mission: Impossible - Ghost Protocol","genres":[1,17,2],"description":"Ethan Hunt and his team are racing against time to track down a dangerous terrorist named Hendricks, who has gained access to Russian nuclear launch codes and is planning a strike on the United States. An attempt to stop him ends in an explosion causing severe destruction to the Kremlin and the IMF to be implicated in the bombing, forcing the President to disavow them. No longer being aided by the government, Ethan and his team chase Hendricks around the globe, although they might still be too late to stop a disaster.","release_date":"2011-12-07","image":"s58mMsgIVOFfoXPtwPWJ3hDYpXf.jpg"},{"id":24,"title":"Star Wars: The Last Jedi","genres":[9,2,15],"description":"Rey develops her newly discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepares to do battle with the First Order.","release_date":"2017-12-13","image":"kOVEVeg59E0wsnXmF9nrh6OmWII.jpg"},{"id":25,"title":"Skyscraper","genres":[1,17,7],"description":"Framed and on the run, a former FBI agent must save his family from a blazing fire in the world's tallest building.","release_date":"2018-07-11","image":"3NL1FiTEhU4SWOuWk8lkVCbmnYm.jpg"},{"id":26,"title":"Jurassic World","genres":[1,2,15,17],"description":"Twenty-two years after the events of Jurassic Park, Isla Nublar now features a fully functioning dinosaur theme park, Jurassic World, as originally envisioned by John Hammond.","release_date":"2015-06-06","image":"jjBgi2r5cRt36xF6iNUEhzscEcb.jpg"},{"id":27,"title":"Guardians of the Galaxy","genres":[1,15,2],"description":"Light years from Earth, 26 years after being abducted, Peter Quill finds himself the prime target of a manhunt after discovering an orb wanted by Ronan the Accuser.","release_date":"2014-07-30","image":"y31QB9kn3XSudA15tV7UWQ9XLuW.jpg"},{"id":28,"title":"The Purge: Election Year","genres":[1,11,17],"description":"Two years after choosing not to kill the man who killed his son, former police sergeant Leo Barnes has become head of security for Senator Charlene Roan, the front runner in the next Presidential election due to her vow to eliminate the Purge. On the night of what should be the final Purge, a betrayal from within the government forces Barnes and Roan out onto the street where they must fight to survive the night.","release_date":"2016-06-29","image":"bjOJFjUffRZQpNQ9g3yvc9F6LBM.jpg"},{"id":29,"title":"Mission: Impossible III","genres":[2,1,17],"description":"Retired from active duty to train new IMF agents, Ethan Hunt is called back into action to confront sadistic arms dealer, Owen Davian. Hunt must try to protect his girlfriend while working with his new team to complete the mission.","release_date":"2006-05-03","image":"qjy8ABAbWooV4jLG6UjzDHlv4RB.jpg"},{"id":30,"title":"Mamma Mia! Here We Go Again","genres":[4,14,12],"description":"On the Greek island of Kalokairi, the daughter of Donna Sheridan, Sophie, finds out more about her mother's past while seeking guidance on how to handle her pregnancy.","release_date":"2018-07-18","image":"aWicerX4Y7n7tUwRAVHsVcBBpj2.jpg"},{"id":31,"title":"Tomb Raider","genres":[1,2,9,7,13,17],"description":"Lara Croft, the fiercely independent daughter of a missing adventurer, must push herself beyond her limits when she finds herself on the island where her father disappeared.","release_date":"2018-03-05","image":"3zrC5tUiR35rTz9stuIxnU1nUS5.jpg"},{"id":32,"title":"Overboard","genres":[14,4],"description":"A spoiled, wealthy yacht owner is thrown overboard and becomes the target of revenge from his mistreated employee. A remake of the 1987 comedy.","release_date":"2018-05-03","image":"qauHzSQJdo9VYX4NKn9PdWnvXOV.jpg"},{"id":33,"title":"Mission: Impossible II","genres":[2,1,17],"description":"With computer genius Luther Stickell at his side and a beautiful thief on his mind, agent Ethan Hunt races across Australia and Spain to stop a former IMF agent from unleashing a genetically engineered biological weapon called Chimera. This mission, should Hunt choose to accept it, plunges him into the center of an international crisis of terrifying magnitude.","release_date":"2000-05-24","image":"eRaEC0vf5q5TSvaoJPwGTt2wa9T.jpg"},{"id":34,"title":"War for the Planet of the Apes","genres":[7,15,18],"description":"Caesar and his apes are forced into a deadly conflict with an army of humans led by a ruthless Colonel. After the apes suffer unimaginable losses, Caesar wrestles with his darker instincts and begins his own mythic quest to avenge his kind. As the journey finally brings them face to face, Caesar and the Colonel are pitted against each other in an epic battle that will determine the fate of both their species and the future of the planet.","release_date":"2017-07-11","image":"oDvgC7IeTdc03SgiSSo2HY7xGYX.jpg"},{"id":35,"title":"How It Ends","genres":[15,17],"description":"A desperate father tries to return home to his pregnant wife after a mysterious apocalyptic event turns everything to chaos.","release_date":"2018-07-13","image":"prdFM08mGvVDA6uQxKJh8n8Vek1.jpg"},{"id":36,"title":"Pacific Rim: Uprising","genres":[1,9,15,2],"description":"It has been ten years since The Battle of the Breach and the oceans are still, but restless. Vindicated by the victory at the Breach, the Jaeger program has evolved into the most powerful global defense force in human history. The PPDC now calls upon the best and brightest to rise up and become the next generation of heroes when the Kaiju threat returns.","release_date":"2018-03-21","image":"v5HlmJK9bdeHxN2QhaFP1ivjX3U.jpg"},{"id":37,"title":"What Happened to Monday","genres":[15,17,7],"description":"In a world where families are limited to one child due to overpopulation, a set of identical septuplets must avoid being put to a long sleep by the government and dangerous infighting while investigating the disappearance of one of their own.","release_date":"2017-08-18","image":"o6EsOqITcSzcdwD1zxBM9imdxjr.jpg"},{"id":38,"title":"Maleficent","genres":[9,2,1,8,14],"description":"The untold story of Disney's most iconic villain from the 1959 classic 'Sleeping Beauty'. A beautiful, pure-hearted young woman, Maleficent has an idyllic life growing up in a peaceable forest kingdom, until one day when an invading army threatens the harmony of the land.  Maleficent rises to be the land's fiercest protector, but she ultimately suffers a ruthless betrayal – an act that begins to turn her heart into stone. Bent on revenge, Maleficent faces an epic battle with the invading King's successor and, as a result, places a curse upon his newborn infant Aurora. As the child grows, Maleficent realizes that Aurora holds the key to peace in the kingdom - and to Maleficent's true happiness as well.","release_date":"2014-05-28","image":"4FYu1AAu14tuBU0lns0hbKiHUcH.jpg"},{"id":39,"title":"Harry Potter and the Philosopher's Stone","genres":[2,9,8],"description":"Harry Potter has lived under the stairs at his aunt and uncle's house his whole life. But on his 11th birthday, he learns he's a powerful wizard -- with a place waiting for him at the Hogwarts School of Witchcraft and Wizardry. As he learns to harness his newfound powers with the help of the school's kindly headmaster, Harry uncovers the truth about his parents' deaths -- and about the villain who's to blame.","release_date":"2001-11-16","image":"dCtFvscYcXQKTNvyyaQr2g2UacJ.jpg"},{"id":40,"title":"The Equalizer 2","genres":[17,1,5],"description":"Robert McCall returns to deliver his special brand of vigilante justice -- but how far will he go when it's someone he loves?","release_date":"2018-07-19","image":"cQvc9N6JiMVKqol3wcYrGshsIdZ.jpg"},{"id":41,"title":"The Avengers","genres":[15,1,2],"description":"When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!","release_date":"2012-04-25","image":"cezWGskPY5x7GaglTTRN4Fugfb8.jpg"},{"id":42,"title":"Blade Runner 2049","genres":[13,15,17],"description":"Thirty years after the events of the first film, a new blade runner, LAPD Officer K, unearths a long-buried secret that has the potential to plunge what's left of society into chaos. K's discovery leads him on a quest to find Rick Deckard, a former LAPD blade runner who has been missing for 30 years.","release_date":"2017-10-04","image":"gajva2L0rPYkEWjzgFlBXCAVBE5.jpg"},{"id":43,"title":"Phoenix Forgotten","genres":[11,13,15],"description":"20 years after three teenagers disappeared in the wake of mysterious lights appearing above Phoenix, Arizona, unseen footage from that night has been discovered, chronicling the final hours of their fateful expedition.","release_date":"2017-04-21","image":"8GJ9a0FgkCKIqKvGtkppTTALGG3.jpg"},{"id":44,"title":"Truth or Dare","genres":[17,11],"description":"A harmless game of \"Truth or Dare\" among friends turns deadly when someone—or something—begins to punish those who tell a lie—or refuse the dare.","release_date":"2018-04-12","image":"zbvziwnZa91AJD78Si0hUb5JP5X.jpg"},{"id":45,"title":"Logan","genres":[1,7,15],"description":"In the near future, a weary Logan cares for an ailing Professor X in a hideout on the Mexican border. But Logan's attempts to hide from the world and his legacy are upended when a young mutant arrives, pursued by dark forces.","release_date":"2017-02-28","image":"gGBu0hKw9BGddG8RkRAMX7B6NDB.jpg"},{"id":46,"title":"Star Wars","genres":[2,1,15],"description":"Princess Leia is captured and held hostage by the evil Imperial forces in their effort to take over the galactic Empire. Venturesome Luke Skywalker and dashing captain Han Solo team together with the loveable robot duo R2-D2 and C-3PO to rescue the beautiful princess and restore peace and justice in the Empire.","release_date":"1977-05-25","image":"btTdmkgIvOi0FFip1sPuZI2oQG6.jpg"},{"id":47,"title":"Guardians of the Galaxy Vol. 2","genres":[1,2,4,15],"description":"The Guardians must fight to keep their newfound family together as they unravel the mysteries of Peter Quill's true parentage.","release_date":"2017-04-19","image":"y4MBh0EjBlMuOzv9axM4qJlmhzz.jpg"},{"id":48,"title":"Spider-Man: Homecoming","genres":[1,2,4,15,7],"description":"Following the events of Captain America: Civil War, Peter Parker, with the help of his mentor Tony Stark, tries to balance his life as an ordinary high school student in Queens, New York City, with fighting crime as his superhero alter ego Spider-Man as a new threat, the Vulture, emerges.","release_date":"2017-07-05","image":"c24sv2weTHPsmDa7jEMN0m2P3RT.jpg"},{"id":49,"title":"Game Night","genres":[13,4,5,17],"description":"Max and Annie's weekly game night gets kicked up a notch when Max's brother Brooks arranges a murder mystery party -- complete with fake thugs and federal agents. So when Brooks gets kidnapped, it's all supposed to be part of the game. As the competitors set out to solve the case, they start to learn that neither the game nor Brooks are what they seem to be. The friends soon find themselves in over their heads as each twist leads to another unexpected turn over the course of one chaotic night.","release_date":"2018-02-22","image":"85R8LMyn9f2Lev2YPBF8Nughrkv.jpg"},{"id":50,"title":"The Maze Runner","genres":[1,13,15,17],"description":"Set in a post-apocalyptic world, young Thomas is deposited in a community of boys after his memory is erased, soon learning they're all trapped in a maze that will require him to join forces with fellow “runners” for a shot at escape.","release_date":"2014-09-10","image":"coss7RgL0NH6g4fC2s5atvf3dFO.jpg"},{"id":51,"title":"Pirates of the Caribbean: The Curse of the Black Pearl","genres":[2,9,1],"description":"Jack Sparrow, a freewheeling 17th-century pirate, quarrels with a rival pirate bent on pillaging Port Royal. When the governor's daughter is kidnapped, Sparrow decides to help the girl's love save her.","release_date":"2003-07-09","image":"tkt9xR1kNX5R9rCebASKck44si2.jpg"},{"id":52,"title":"Geostorm","genres":[1,15,17],"description":"After an unprecedented series of natural disasters threatened the planet, the world's leaders came together to create an intricate network of satellites to control the global climate and keep everyone safe. But now, something has gone wrong: the system built to protect Earth is attacking it, and it becomes a race against the clock to uncover the real threat before a worldwide geostorm wipes out everything and everyone along with it.","release_date":"2017-10-13","image":"nrsx0jEaBgXq4PWo7SooSnYJTv.jpg"},{"id":53,"title":"Split","genres":[11,17],"description":"Though Kevin has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher, there remains one still submerged who is set to materialize and dominate all the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him — as well as everyone around him — as the walls between his compartments shatter apart.","release_date":"2017-01-19","image":"rXMWOZiCt6eMX22jWuTOSdQ98bY.jpg"},{"id":54,"title":"Unfriended: Dark Web","genres":[11],"description":"​When a 20-something finds a cache of hidden files on his new laptop, he and his friends are unwittingly thrust into the depths of the dark web.  They soon discover someone has been watching their every move and will go to unimaginable lengths to protect the dark web.","release_date":"2018-07-20","image":"gnj2opTQWGaLtB7kZ4OuMtG2RWa.jpg"},{"id":55,"title":"Captain America: Civil War","genres":[2,1,15],"description":"Following the events of Age of Ultron, the collective governments of the world pass an act designed to regulate all superhuman activity. This polarizes opinion amongst the Avengers, causing two factions to side with Iron Man or Captain America, which causes an epic battle between former allies.","release_date":"2016-04-27","image":"kSBXou5Ac7vEqKd97wotJumyJvU.jpg"},{"id":56,"title":"I Feel Pretty","genres":[4],"description":"A head injury causes a woman to develop an extraordinary amount of confidence and believe she's drop dead gorgeous.","release_date":"2018-04-19","image":"iuPs45XIxfARKPLEkCGXWUrBrTR.jpg"},{"id":57,"title":"Justice League","genres":[1,2,9,15],"description":"Fuelled by his restored faith in humanity and inspired by Superman's selfless act, Bruce Wayne and Diana Prince assemble a team of metahumans consisting of Barry Allen, Arthur Curry and Victor Stone to face the catastrophic threat of Steppenwolf and the Parademons who are on the hunt for three Mother Boxes on Earth.","release_date":"2017-11-15","image":"eifGNCSDuxJeS1loAXil5bIGgvC.jpg"},{"id":58,"title":"Red Sparrow","genres":[13,17],"description":"Prima ballerina, Dominika Egorova faces a bleak and uncertain future after she suffers an injury that ends her career. She soon turns to Sparrow School, a secret intelligence service that trains exceptional young people to use their minds and bodies as weapons. Dominika emerges as the most dangerous Sparrow after completing the sadistic training process. As she comes to terms with her new abilities, she meets a CIA agent who tries to convince her that he is the only person she can trust.","release_date":"2018-02-28","image":"vLCogyfQGxVLDC1gqUdNAIkc29L.jpg"},{"id":59,"title":"Deadpool","genres":[1,2,4],"description":"Deadpool tells the origin story of former Special Forces operative turned mercenary Wade Wilson, who after being subjected to a rogue experiment that leaves him with accelerated healing powers, adopts the alter ego Deadpool. Armed with his new abilities and a dark, twisted sense of humor, Deadpool hunts down the man who nearly destroyed his life.","release_date":"2016-02-09","image":"inVq3FRqcYIRl2la8iZikYYxFNR.jpg"},{"id":60,"title":"The Lord of the Rings: The Fellowship of the Ring","genres":[2,9,1],"description":"Young hobbit Frodo Baggins, after inheriting a mysterious ring from his uncle Bilbo, must leave his home in order to keep it from falling into the hands of its evil creator. Along the way, a fellowship is formed to protect the ringbearer and make sure that the ring arrives at its final destination: Mt. Doom, the only place where it can be destroyed.","release_date":"2001-12-18","image":"eDkDYEUIHEp5qavNa5k6XsMHgbf.jpg"},{"id":61,"title":"12 Strong","genres":[18,7,10],"description":"A team of CIA agents and special forces head into Afghanistan in the aftermath of the September 11th attacks in an attempt to dismantle the Taliban.","release_date":"2018-01-16","image":"j18021qCeRi3yUBtqd2UFj1c0RQ.jpg"},{"id":62,"title":"Avengers: Age of Ultron","genres":[1,2,15],"description":"When Tony Stark tries to jumpstart a dormant peacekeeping program, things go awry and Earth’s Mightiest Heroes are put to the ultimate test as the fate of the planet hangs in the balance. As the villainous Ultron emerges, it is up to The Avengers to stop him from enacting his terrible plans, and soon uneasy alliances and unexpected action pave the way for an epic and unique global adventure.","release_date":"2015-04-22","image":"t90Y3G8UGQp0f0DrP60wRu9gfrH.jpg"},{"id":63,"title":"Thor: The Dark World","genres":[1,2,9],"description":"Thor fights to restore order across the cosmos… but an ancient race led by the vengeful Malekith returns to plunge the universe back into darkness. Faced with an enemy that even Odin and Asgard cannot withstand, Thor must embark on his most perilous and personal journey yet, one that will reunite him with Jane Foster and force him to sacrifice everything to save us all.","release_date":"2013-10-29","image":"bnX5PqAdQZRXSw3aX3DutDcdso5.jpg"},{"id":64,"title":"Sicario: Day of the Soldado","genres":[1,5,7,17],"description":"FBI agent Matt Graver teams up with operative Alejandro Gillick to prevent Mexican drug cartels from smuggling terrorists across the U.S. border.","release_date":"2018-06-27","image":"OdD7A0LgLXPjqzmfcEl9sTYVPo.jpg"},{"id":65,"title":"X-Men: Apocalypse","genres":[1,2,15,9],"description":"After the re-emergence of the world's first mutant, world-destroyer Apocalypse, the X-Men must unite to defeat his extinction level plan.","release_date":"2016-05-18","image":"zSouWWrySXshPCT4t3UKCQGayyo.jpg"},{"id":66,"title":"Annihilation","genres":[13,15,17,11],"description":"A biologist signs up for a dangerous, secret expedition into a mysterious zone where the laws of nature don't apply.","release_date":"2018-02-22","image":"d3qcpfNwbAMCNqWDHzPQsUYiUgS.jpg"},{"id":67,"title":"The Fate of the Furious","genres":[2,1,5,17,13],"description":"When a mysterious woman seduces Dom into the world of crime and a betrayal of those closest to him, the crew face trials that will test them as never before.","release_date":"2017-04-12","image":"dImWM7GJqryWJO9LHa3XQ8DD5NH.jpg"},{"id":68,"title":"Thor","genres":[2,9,1],"description":"Against his father Odin's will, The Mighty Thor - a powerful but arrogant warrior god - recklessly reignites an ancient war. Thor is cast down to Earth and forced to live among humans as punishment. Once here, Thor learns what it takes to be a true hero when the most dangerous villain of his world sends the darkest forces of Asgard to invade Earth.","release_date":"2011-04-21","image":"bIuOWTtyFPjsFDevqvF3QrD1aun.jpg"},{"id":69,"title":"Unsane","genres":[11,17],"description":"A woman is involuntarily committed to a mental institution where she is confronted by her greatest fear.","release_date":"2018-03-22","image":"jvDBfavZASdKsJunu9VCAtXjLS2.jpg"},{"id":70,"title":"Coco","genres":[3],"description":"Despite his family’s baffling generations-old ban on music, Miguel dreams of becoming an accomplished musician like his idol, Ernesto de la Cruz. Desperate to prove his talent, Miguel finds himself in the stunning and colorful Land of the Dead following a mysterious chain of events. Along the way, he meets charming trickster Hector, and together, they set off on an extraordinary journey to unlock the real story behind Miguel's family history.","release_date":"2017-10-27","image":"eKi8dIrr8voobbaGzDpe8w0PVbC.jpg"},{"id":71,"title":"Interstellar","genres":[2,7,15],"description":"Interstellar chronicles the adventures of a group of explorers who make use of a newly discovered wormhole to surpass the limitations on human space travel and conquer the vast distances involved in an interstellar voyage.","release_date":"2014-11-05","image":"nBNZadXqJSdt05SHLqgT0HuC5Gm.jpg"},{"id":72,"title":"Sleight","genres":[7,17,1,15],"description":"A young street magician is left to take care of his little sister after his mother's passing and turns to drug dealing in the Los Angeles party scene to keep a roof over their heads. When he gets into trouble with his supplier, his sister is kidnapped and he is forced to rely on both his sleight of hand and brilliant mind to save her.","release_date":"2017-04-28","image":"wridRvGxDqGldhzAIh3IcZhHT5F.jpg"},{"id":73,"title":"Doctor Strange","genres":[1,2,9,15],"description":"After his career is destroyed, a brilliant but arrogant surgeon gets a new lease on life when a sorcerer takes him under her wing and trains him to defend the world against evil.","release_date":"2016-10-25","image":"4PiiNGXj1KENTmCBHeN6Mskj2Fq.jpg"},{"id":74,"title":"The Equalizer","genres":[17,1,5],"description":"In The Equalizer, Denzel Washington plays McCall, a man who believes he has put his mysterious past behind him and dedicated himself to beginning a new, quiet life. But when McCall meets Teri (Chloë Grace Moretz), a young girl under the control of ultra-violent Russian gangsters, he can’t stand idly by – he has to help her. Armed with hidden skills that allow him to serve vengeance against anyone who would brutalize the helpless, McCall comes out of his self-imposed retirement and finds his desire for justice reawakened. If someone has a problem, if the odds are stacked against them, if they have nowhere else to turn, McCall will help. He is The Equalizer.","release_date":"2014-09-24","image":"2eQfjqlvPAxd9aLDs8DvsKLnfed.jpg"},{"id":75,"title":"Pirates of the Caribbean: Dead Man's Chest","genres":[2,9,1],"description":"Captain Jack Sparrow works his way out of a blood debt with the ghostly Davey Jones, he also attempts to avoid eternal damnation.","release_date":"2006-06-20","image":"waFr5RVKaQ9dzOt3nQuIVB1FiPu.jpg"},{"id":76,"title":"X-Men: Days of Future Past","genres":[1,2,9,15],"description":"The ultimate X-Men ensemble fights a war for the survival of the species across two time periods as they join forces with their younger selves in an epic battle that must change the past – to save our future.","release_date":"2014-05-15","image":"qKkFk9HELmABpcPoc1HHZGIxQ5a.jpg"},{"id":77,"title":"Beauty and the Beast","genres":[8,9,14],"description":"A live-action adaptation of Disney's version of the classic tale of a cursed prince and a beautiful young woman who helps him break the spell.","release_date":"2017-03-16","image":"tWqifoYuwLETmmasnGHO7xBjEtt.jpg"},{"id":78,"title":"Dawn of the Planet of the Apes","genres":[15,1,7,17],"description":"A group of scientists in San Francisco struggle to stay alive in the aftermath of a plague that is wiping out humanity, while Caesar tries to maintain dominance over his community of intelligent apes.","release_date":"2014-06-26","image":"2EUAUIu5lHFlkj5FRryohlH6CRO.jpg"},{"id":79,"title":"Fifty Shades Darker","genres":[7,14],"description":"When a wounded Christian Grey tries to entice a cautious Ana Steele back into his life, she demands a new arrangement before she will give him another chance. As the two begin to build trust and find stability, shadowy figures from Christian’s past start to circle the couple, determined to destroy their hopes for a future together.","release_date":"2017-02-08","image":"aybgjbFbn6yUbsgUMnUbwc2jcWd.jpg"},{"id":80,"title":"Aage Ki Soch","genres":[4],"description":"Aage Ki Soch is 1988 Hindi language movie directed by Dada Kondke and starring Shakti Kapoor, Dada Kondke, Swapna, Raza Murad, and Satish Shah","release_date":"1988-01-01","image":"qSJ0j8PQrhEzmd7jlwpxS4liQI7.jpg"}]}